#+TITLE: IMF Language v2.1
#+DATE: Editor: Martin G. Skjæveland
#+AUTHOR:
#+EMAIL:

#+OPTIONS: ':nil *:t -:t ::t <:t H:4 \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport QA update old
#+EXPORT_FILE_NAME: index.html

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [12pt]
#+LATEX_HEADER: \usepackage{fullpage,parskip,times}
#+LATEX_HEADER: \usepackage{xcolor}
#+LATEX_HEADER: \usepackage[zerostyle=d]{newtxtt} %% Various versions of zeros available. See documentation for details
 

** Ontology header

#+NAME: owl-imf-ontology
#+BEGIN_SRC ttl :noweb strip-export :tangle out/owl/imf.owl.wottr.ttl :mkdirp yes
<<prefixes>>

<http://ns.imfid.org/imf> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/20230630/imf> ;
    owl:versionInfo "0.2.0" ;
    owl:priorVersion <https://ns.imfid.org/20221118/imf> ;
    skos:prefLabel "Information Modelling Framework Ontology" ;
    skos:altLabel "The IMF Ontology" ;
    vann:namespacePrefix "imf" ;
    vann:namespaceURI <http://ns.imfid.org/imf#> ;
    pav:createdOn "2023-06-30T00:00:00"^^xsd:dateTime ;
    pav:createdBy _:mgs ;
    pav:contributedBy _:mgs, _:aw, _:ef ;
    foaf:depiction <imf-overview.png> ;
    skos:changeNote 
      """0.2.0 :: Change summary:
- Change: minor naming adjustments to some IRIs. 
- Added metadata descriptions, including definitions and statuses.

Generated changelog that only checks the occurrence of IRIs in the IMF namespace between this and the previous version of the ontology:

<<py_iri_rdf_diff(v2="out/owl/imf.owl.ttl", v1="https://ns.imfid.org/20221118/imf-vocabulary.owl.ttl")>>

""" ;
    # cc:licence 
    # skos:scopeNote ## add description of ontology

    skos:editorialNote 
      "On versioning. Versions of this ontology and other semantic web resources are published an URL following this schema:  http://ns.imfid.org/[yyyy-mm-dd]/[resource-name]" ,
      "On statuses. All terms in the ontology are given a status using the 'term_status' property from the 'Term-centric Semantic Web Vocabulary Annotations' vocabulary (https://www.w3.org/2003/06/sw-vocab-status/note.html), and one of the values 'unstable', 'testing', 'stable' and 'archaic'. In this version of the ontology the highest status is 'testing'. Terms that are 'unstable' contain also this word in their label." ,
      """References to external vocabularies used by this ontology:
- SKOS: https://www.w3.org/TR/skos-primer/ ;
- VANN: https://vocab.org/vann/ ;
- PAV: https://pav-ontology.github.io/pav/ ;
""" ,
      """On naming conventions. 
- Classes use UpperCamelCase;
- Properties use lowerCamelCase, where
   - object properties between IMF Classes usually start with a verb, e.g., 'has',
   - object properties for reified properties start with 'the',
   - object properties to external libraries, datatype properties, and annotation properties do not start with a verb;
 - Individuals use lowerCamelCase.
""" ,
      "On definitions. When referring to terms in the ontology, the following format is used: [prefLabel], where prefLabel is set by the property skos:prefLabel." ;

    skos:editorialNote """
<<sh_jena_shacl_validate(shapes="http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl", data="out/owl/imf.owl.ttl")>>
    """

    .

_:mgs foaf:name "Martin G. Skjæveland" .
_:aw  foaf:name "Arild Waaler" .
_:ef  foaf:name "Erlend Fjøsna" .

<<owl-imf-ontology-all-includes>>
#+END_SRC

#+RESULTS: owl-imf-ontology
#+begin_example
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix sh: 	<http://www.w3.org/ns/shacl#> . 
@prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> .

@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix pav:	<http://purl.org/pav/> .
@prefix vs:     <http://www.w3.org/2003/06/sw-vocab-status/ns#> .
@prefix vann:   <http://purl.org/vocab/vann/> .
@prefix foaf:   <http://xmlns.com/foaf/0.1/> .

@prefix imf:	<http://ns.imfid.org/imf#> .
@prefix ex:	<http://example.com#> .

@prefix p14:    <http://example.com/P14#> .
@prefix ottr:        <http://ns.ottr.xyz/0.4/> .
@prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> .
@prefix o-rdfs:       <http://tpl.ottr.xyz/rdfs/0.2/> .
@prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> .
@prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> .
@prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> .

@prefix o-imf:	     <http://ns.imfid.org/templates/> .
@prefix o-imf-t-s:   <http://ns.imfid.org/templates/type/shacl/> .
@prefix o-imf-t-o:   <http://ns.imfid.org/templates/type/owl/> .


<http://ns.imfid.org/imf> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/20230630/imf> ;
    owl:versionInfo "0.2.0" ;
    owl:priorVersion <https://ns.imfid.org/20221118/imf> ;
    skos:prefLabel "Information Modelling Framework Ontology" ;
    skos:altLabel "The IMF Ontology" ;
    vann:namespacePrefix "imf" ;
    vann:namespaceURI <http://ns.imfid.org/imf#> ;
    pav:createdOn "2023-06-30T00:00:00"^^xsd:dateTime ;
    pav:createdBy _:mgs ;
    pav:contributedBy _:mgs, _:aw, _:ef ;
    skos:changeNote 
      """0.2.0 :: Change summary:
- Change: minor naming adjustments to some IRIs. 
- Added metadata descriptions, including definitinos and statuses.

Generated changelog that only checks the occurrence of IRIs in the IMF namespace between this and the previous version of the ontology:

 - IRIs present in both versions :: ns1:imf, imf:Aspect, imf:AspectElement, imf:Block, imf:FunctionBlock, imf:FunctionTerminal, imf:InputTerminal, imf:InstalledBlock, imf:InstalledTerminal, imf:LocationBlock, imf:LocationTerminal, imf:OutputTerminal, imf:ProductBlock, imf:ProductTerminal, imf:Terminal, imf:associativeRelation, imf:color, imf:hasAspect, imf:hasInputTerminal, imf:hasOutputTerminal, imf:hasPart, imf:hasTerminal, imf:hierarchicalRelation, imf:interAspectRelation, imf:intraAspectRelation, imf:prefix, imf:theInput, imf:theOutput

 - IRIs present only in this version :: ns2:imf, imf:, imf:Attribute, imf:AttributeQualifier, imf:BreakdownPoint, imf:ConnectionPoint, imf:Element, imf:FunctionElement, imf:InstalledElement, imf:LocationElement, imf:ProductElement, imf:ProvenanceQualifier, imf:RangeQualifier, imf:RegularityQualifier, imf:ScopeQualifier, imf:TerminalQualifier, imf:absoluteQualifier, imf:asFunction, imf:asInstalled, imf:asLocation, imf:asProduct, imf:averageQualifier, imf:calculatedQualifier, imf:classifier, imf:connectedTo, imf:continuousQualifier, imf:designQualifier, imf:externalReference, imf:functionAspect, imf:hasAttribute, imf:hasAttributeQualifier, imf:hasTerminalQualifier, imf:hierachicalRelation, imf:inputFlow, imf:installedAspect, imf:locationAspect, imf:maximumQualifier, imf:measuredQualifier, imf:medium, imf:minimumQualifier, imf:nominalQualifier, imf:normalQualifier, imf:operatingQualifier, imf:outputFlow, imf:partOf, imf:productAspect, imf:property, imf:specifiedQualifier, imf:symbol, imf:theConnected, imf:thePart, imf:theWhole, imf:uom, imf:value

 - IRIs present only in previous version :: ns3:imf-vocabulary, imf:FunctionAspect, imf:FunctionAspectElement, imf:FunctionInterfacePoint, imf:InstalledAspect, imf:InstalledAspectElement, imf:InstalledInterfacePoint, imf:InterAspectRelation, imf:InterfacePoint, imf:LocationAspect, imf:LocationAspectElement, imf:LocationInterfacePoint, imf:ProductAspect, imf:ProductAspectElement, imf:ProductInterfacePoint, imf:System, imf:SystemElement, imf:fulfilledBy, imf:fulfills, imf:isConnectedTo, imf:isPartOf, imf:memberOf

""" ;
    # cc:licence 
    # skos:scopeNote ## add description of ontology

    skos:editorialNote 
      "On versioning. Versions of this ontology and other semantic web resources are published an URL following this schema:  http://ns.imfid.org/[yyyy-mm-dd]/[resource-name]" ,
      "On statuses. All terms in the ontology are given a status using the 'term_status' property from the 'Term-centric Semantic Web Vocabulary Annotations' vocabulary (https://www.w3.org/2003/06/sw-vocab-status/note.html), and one of the values 'unstable', 'testing', 'stable' and 'archaic'. In this version of the ontology the highest status is 'testing'. Terms that are 'unstable' contain also this word in their label." ,
      """References to external vocabularies used by this ontology:
- SKOS: https://www.w3.org/TR/skos-primer/ ;
- VANN: https://vocab.org/vann/ ;
- PAV: https://pav-ontology.github.io/pav/ ;
""" ,
      """On naming conventions. 
- Classes use UpperCamelCase;
- Properties use lowerCamelCase, where
   - object properties between IMF Classes usually start with a verb, e.g., ~has~,
   - object properties for reified properties start with ~the~,
   - object properties to external libraries, datatype properties, and annotation properties do not start with a verb;
 - Individuals use lowerCamelCase.
""" ,
      "On definitions. When referring to terms in the ontology, the following format is used: [prefLabel], where prefLabel is set by the property skos:prefLabel."

    skos:editoralNote """Automatic validation:

Result of validating RDF data <out/owl/imf.owl.ttl> against SHACL shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:

Conforms


    """

    .

_:mgs foaf:name "Martin G. Skjæveland" .
_:aw  foaf:name "Arild Waaler" .
_:ef  foaf:name "Erlend Fjøsna" .


imf:externalReference a owl:ObjectProperty ;
    skos:prefLabel "external reference" ;
    vs:term_status "testing" ;
    skos:definition "[external reference] is a generic relation that relates a resource *X* to a resource in an external ontology or reference data library for added semantic description of *X*." ;
    skos:changeNote 
      "0.2.0 :: Added" ;
    vann:termGroup "generic relations" ;
.

imf:hierarchicalRelation a owl:ObjectProperty ;
    skos:prefLabel "hierarchical relation";
    vs:term_status "testing" ;
    skos:definition "[hierarchical relation] is a generic relation that relates resources in a hierarchical or tree-shaped structure." ;
    rdfs:seeAlso <https://en.wikipedia.org/wiki/Tree_(data_structure)> ;
    skos:changeNote 
      "0.1.0 :: Added" ;
    vann:termGroup "generic relations" ;
    a owl:IrreflexiveProperty ;
    rdfs:subPropertyOf skos:semanticRelation ;
    
    .

imf:associativeRelation a owl:ObjectProperty ;
    skos:prefLabel "associative relation";
    vs:term_status "testing" ;
    skos:definition "[associative relation] is a generic relation that relates resources in an associative (or non-hierarchical) structure." ;
    skos:changeNote 
      "0.1.0 :: Added" ;
    vann:termGroup "generic relations" ;
    rdfs:subPropertyOf skos:related ;
    owl:propertyDisjointWith imf:hierachicalRelation ;
    
    .

imf:Element a owl:Class ;
  skos:prefLabel "Element" ;
  vs:term_status "testing" ;
  skos:definition "An [Element] represents an abstraction over a system or a system element as per ISO/IEC/IEEE 15288." ;
  skos:scopeNote "Avoid direct instantiation of [Element], use instead one of its subclasses." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
. 

# In anticipation of more direct subclasses, this is commented out:
#[] ottr:of o-owl-ma:ClassPartition ;
#   ottr:values ( imf:Element ( imf:Block imf:Terminal ) ) .

imf:Block a owl:Class ;
  skos:prefLabel "Block" ;
  vs:term_status "testing" ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subClassOf imf:Element ;
  skos:definition "A [block] is an [element] that ???"
  .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values (imf:Block imf:partOf imf:Block) .

imf:Terminal a owl:Class ;
  skos:prefLabel "Terminal" ;
  skos:altLabel "Port", "Channel", "Input/Output" ;
  vs:term_status "testing" ;
  skos:definition "A [Terminal] is an [Element] that represents a point of interaction or communication for a given [Block] (through the relation [has terminal]), and hence specifies an input and/or output that the [Block] produces and/or receives." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subClassOf imf:Element ;
  .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values (imf:Terminal imf:partOf imf:Terminal) .

imf:hasTerminal a owl:ObjectProperty ;
  skos:prefLabel "has terminal" ;
  vs:term_status "testing" ;
  skos:definition "[has terminal] is an [associative relation] and an [intra-aspect relation] that relates a [Block] *B* to a [Terminal] *T* to specify that *T* is a terminal of, or belongs to, *B*. [has terminal] is an inverse functional property which means that a [Terminal] may only belong to one [Block]." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  a owl:InverseFunctionalProperty ;
  rdfs:subPropertyOf imf:intraAspectRelation , imf:associativeRelation ;
  rdfs:domain imf:Block ;
  rdfs:range imf:Terminal ;
  .

[] ottr:of o-owl-ax:SubObjectSomeValuesFrom ;
   ottr:values (imf:Terminal [ owl:inverseOf imf:hasTerminal ] imf:Block ) .

imf:TerminalQualifier a owl:Class ;
  skos:prefLabel "Terminal Qualifier" ;
  vs:term_status "testing" ;
  skos:definition "[Terminal Qualifier] is a feature or characteristic of a [Terminal]." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  .

imf:inputFlow a owl:NamedIndividual, imf:TerminalQualifier ;
  skos:prefLabel "input flow" ;
  vs:term_status "testing" ;
  skos:definition "[input flow] is a [Terminal Qualifier] that indicates that the flow is incoming to the [Terminal] it qualifies." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
.

imf:outputFlow a owl:NamedIndividual, imf:TerminalQualifier ;
  skos:prefLabel "output flow" ;
  vs:term_status "testing" ;
  skos:definition "[output flow] is a [Terminal Qualifier] that indicates that the flow is outgoing from the [Terminal] it qualifies." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  .

[] ottr:of o-owl-ax:DifferentIndividuals ;
   ottr:values ( ( imf:inputFlow imf:outputFlow ) ) .

imf:hasTerminalQualifier a owl:ObjectProperty ;
  skos:prefLabel "has terminal qualifier" ;
  vs:term_status "testing" ;
  skos:definition "[has terminal qualifier] relates a [Terminal] *T* to a [Terminal Qualifier] *Q* to specify that *T* has the qualifier *Q*." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:domain imf:Terminal ;
  rdfs:range imf:TerminalQualifier .

imf:InputTerminal a owl:Class ;
  skos:prefLabel "Input Terminal" ;
  skos:altLabel "Input" ;
  vs:term_status "testing" ;
  skos:definition "An [Input Terminal] is a [Terminal] that accepts input (and not output)." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subClassOf imf:Terminal ;
  .

[] ottr:of o-owl-ax:EquivHasValue ;
   ottr:values ( imf:InputTerminal imf:hasTerminalQualifier imf:inputFlow ) .

imf:OutputTerminal a owl:Class ;
  skos:prefLabel "Output Terminal" ;
  skos:altLabel "Output" ;
  vs:term_status "testing" ;
  skos:definition "An [Output Terminal] is a [Terminal] that accepts output (and not input)." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subClassOf imf:Terminal ;
  .

[] ottr:of o-owl-ax:EquivHasValue ;
   ottr:values ( imf:OutputTerminal imf:hasTerminalQualifier imf:outputFlow ) .

imf:hasInputTerminal a owl:ObjectProperty ;
  skos:prefLabel "has input terminal" ;
  vs:term_status "testing" ;
  skos:definition "[has input terminal] specialises the [has terminal] property to relate [Block]s to [InputTerminal]s." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:hasTerminal ;
  rdfs:range imf:InputTerminal ;
  .

imf:hasOutputTerminal a owl:ObjectProperty ;
  skos:prefLabel "has output terminal" ;
  vs:term_status "testing" ;
  skos:definition "[has output terminal] specialises the [has terminal] property to relate [Block]s to [Output Terminal]s." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:hasTerminal ;
  rdfs:range imf:OutputTerminal ;
  .

skos:notation a owl:DatatypeProperty ;
  skos:scopeNote "From the SKOS reference: 'A notation is a string of characters such as \"T58.5\" or \"303.4833\" used to uniquely identify a concept within the scope of a given concept scheme.' Use skos:notation to set a RDS string."
  .

imf:symbol a owl:AnnotationProperty ;
  skos:prefLabel "symbol" ;
  vs:term_status "testing" ;
  skos:definition "[symbol] associates a resource *X* with a typical graphical representation of *X*." ;
  skos:changeNote "0.2.0 :: Added" ;
  vann:termGroup "aspects" ;
  .

imf:partOf a owl:ObjectProperty;
  skos:prefLabel "part of" ;
  skos:altLabel "has parent" ;
  vs:term_status "testing" ;
  skos:definition "[part of] is a [hierarchical relation] and an [intra-aspect relation] that relates an [Element] *E1* and an [Element] *E2* to specify that *E1* is part of *E2*, or equivalently that *E2* has *E1* as a part. [part of] is used to specify a breakdown hierarchy of [Element]s." ;
  skos:scopeNote "\"An [Element] may only have one 'parent'\": [part of] is functional and irreflexive property which means that any [Element] may only be part of one other [Element], that is: an [Element] may not be part of multiple [Element]s and it may not be part of itself." ; 
  skos:changeNote 
    "0.1.0 :: Added" ,
    "0.2.0 :: Changed: IRI from imf:isPartOf to imf:partOf." ;
  vann:termGroup "elements" ;
  a owl:FunctionalProperty ;
  a owl:IrreflexiveProperty ;
  rdfs:subPropertyOf imf:intraAspectRelation, imf:hierarchicalRelation, skos:broader ;
  rdfs:domain imf:Element ;
  rdfs:range imf:Element ;
  .

imf:hasPart a owl:ObjectProperty ;
  skos:prefLabel "has part";
  skos:altLabel "has child";
  vs:term_status "testing" ;
  skos:definition "[has part] is a [hierarchical relation] and an [intra-aspect relation] that is the inverse relation of [part of]." ;
  skos:scopeNote "Use [has part] when you want to specify the [Element]s that are part of an [Element] *E* \"on *E*\", rather than using the inverse property [part of] to state that the [part of] relationship to *E* for every [Element] that is part of *E*." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:intraAspectRelation, imf:hierarchicalRelation, skos:narrower ;
  owl:inverseOf imf:partOf ;
  .

imf:connectedTo a owl:ObjectProperty ;
  skos:prefLabel "connected to" ;
  vs:term_status "testing" ;
  skos:definition "[connected to] is an [associative relation] and an [intra-aspect relation] that relates a [Terminal] *T1* to a [Terminal] *T2* to specify that *T1* is connected to *T2*. [connected to] specifies a topology of [Element]s by relating the [Terminal]s of [Block]s and hence describes how [Block]s are interconnected and indicates how they interact." ;
  skos:scopeNote "[connected to] is a 1-1 relationship: a [Terminal] may only be [connected to] one other [Terminal], that is, a [Terminal] may not be [connected to] multiple [Terminal]s and it may not be [connected to] itself." ;
  skos:changeNote 
    "0.1.0 :: Added" ,
    "0.2.0 :: Changed IRI from imf:isConnectedTo to imf:connectedTo." ;
  skos:editorialNote "Should connectedTo be symmetric?" ;
  vann:termGroup "elements" ;
  a owl:FunctionalProperty ;
  a owl:InverseFunctionalProperty ;
  a owl:IrreflexiveProperty ; 
  rdfs:subPropertyOf imf:intraAspectRelation , imf:associativeRelation ;
  rdfs:domain imf:Terminal ;
  rdfs:range imf:Terminal ;
  .

imf:classifier a owl:ObjectProperty ;
  skos:prefLabel "classifier" ;
  vs:term_status "testing" ;
  skos:definition "[classifier] is an [external reference] that relates an [Element] *E* to a resource *X* in an external ontology or reference data library such that *X* classifies *E* -- or equivalently, *E* is an instance of *X*." ;
  skos:example "[classifier] is used to relate a [Block] that is specified to perform a pumping function to the external resource PUMPING <https://data.posccaesar.org/rdl/RDS9657917>. We then say that the [Block] is classified by PUMPING, or that the [Block] is an instance of PUMPING." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:externalReference ;
  .

imf:medium a owl:ObjectProperty  ;
  skos:prefLabel "medium" ;
  vs:term_status "testing" ;
  skos:definition "[medium] is an [external reference] that relates a [Terminal] *T* to a resource *X* to specify that *X* is the medium that flows through *T*." ;
  skos:example """[medium] is typically used to relate a [Terminal] to an resource that specifies one of the following:
 Material (Fluid, Solids),
 Energy (Mechanical, Electrical, Thermal),
 Force (Mechanical),
 Information(Electrical, Optical, Wireless)
""" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:externalReference ;
  rdfs:domain imf:Terminal ;
  .


imf:BreakdownPoint a owl:Class ;
  skos:prefLabel "Breakdown Point (unstable)" ;
  vs:term_status "unstable" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subClassOf imf:Element ;
  .

imf:thePart a owl:ObjectProperty ;
  skos:prefLabel "the part (unstable)" ;
  vs:term_status "unstable" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  a owl:FunctionalProperty ;
  rdfs:subPropertyOf imf:intraAspectRelation, imf:associativeRelation ;
  skos:editorialNote "Is [thePart] and [theWhole] associative, hierachical or none?" ; 
  rdfs:domain imf:BreakdownPoint ;
  rdfs:range imf:Element .

imf:theWhole a owl:ObjectProperty ;
  skos:prefLabel "the whole (unstable)" ;
  vs:term_status "unstable" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  a owl:FunctionalProperty ;
  rdfs:subPropertyOf imf:intraAspectRelation, imf:associativeRelation ;
  rdfs:domain imf:BreakdownPoint ;
  rdfs:range imf:Element .

[] ottr:of o-owl-ax:SubObjectSomeValuesFrom ;
   ottr:values ( imf:BreakdownPoint imf:thePart imf:Element ) .
[] ottr:of o-owl-ax:SubObjectSomeValuesFrom ;
   ottr:values ( imf:BreakdownPoint imf:theWhole imf:Element ) .

### Problem: gives non-simple property
#imf:partOf a owl:ObjectProperty ;
#  owl:propertyChainAxiom ( [ owl:inverseOf imf:thePart ] imf:theWhole ) .


imf:ConnectionPoint a owl:Class ;
  skos:prefLabel "Connection Point (unstable)" ;
  vs:term_status "unstable" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subClassOf imf:Element ;
  .

imf:theConnected a owl:ObjectProperty ;
  skos:prefLabel "the connected (unstable)" ;
  vs:term_status "unstable" ;
  rdfs:subPropertyOf imf:intraAspectRelation, imf:associativeRelation ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:domain imf:ConnectionPoint ;
  rdfs:range imf:Terminal . 

[] ottr:of o-owl-ax:SubObjectExactCardinality ;
   ottr:values( imf:ConnectionPoint "2"^^xsd:nonNegativeInteger imf:theConnected imf:Element ) .
[] ottr:of o-owl-ax:SubObjectMaxCardinality ;
   ottr:values( imf:ConnectionPoint "1"^^xsd:nonNegativeInteger imf:theInput imf:Element ) .
[] ottr:of o-owl-ax:SubObjectMaxCardinality ;
   ottr:values( imf:ConnectionPoint "1"^^xsd:nonNegativeInteger imf:theOutput imf:Element ) .

imf:theInput a owl:ObjectProperty ;
  skos:prefLabel "the input (unstable)" ;
  vs:term_status "unstable" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:theConnected ;
  rdfs:range imf:OutputTerminal . 

imf:theOutput a owl:ObjectProperty ;
  skos:prefLabel "the output (unstable)" ;
  vs:term_status "unstable" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "elements" ;
  rdfs:subPropertyOf imf:theConnected ;
  rdfs:range imf:InputTerminal .

### Problem: gives non-simple property
#imf:connectedTo a owl:ObjectProperty ;
#  owl:propertyChainAxiom ( imf:theOutput [ owl:inverseOf imf:theInput ] ) .

imf:AspectElement a owl:Class ;
  skos:prefLabel "Aspect Element";
  skos:definition "An [Aspect Element] is an [Element] that has exactly one [Aspect]." ;
  vs:term_status "testing" ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;

  # an aspect element is an element with an aspect:
  owl:equivalentClass [
    rdf:type owl:Class ;
    owl:intersectionOf ( 
      imf:Element
      [ rdf:type owl:Restriction ;
        owl:onProperty imf:hasAspect ;
        owl:qualifiedCardinality "1"^^xsd:nonNegativeInteger ;
        owl:onClass imf:Aspect 
      ]
  ) ] 
  .

imf:hasAspect a owl:ObjectProperty ;
  skos:prefLabel "has aspect" ;
  vs:term_status "testing" ;
  skos:definition "[has aspect] is a relation from an [Element] *E* to an [Aspect] *A* that specfies that *E* has the [Aspect] *A*." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;
  rdfs:domain imf:Element ;
  rdfs:range imf:Aspect .

imf:Aspect a owl:Class ;
  skos:prefLabel "Aspect" ;
  vs:term_status "testing" ;
  skos:definition """
  An [Aspect] describes a context for interpreting [Element]s. An [Aspect] specifies a /perspective/, an /interest/, and a /modality/. 
  /Perspective/ refers to from which viewpoint the [Element] is interpreted.
  /Interest/ refers to the scope for which the information is intended used.
  /Modality/ refers to the form in which information is recorded.
""" ;
  skos:scopeNote "Aspect is a core concept of ISO/IEC 81346 and the IMF ontology includes aspects that are found in ISO/IEC 81346: function, location and product. We anticipate that more aspects will be added to support future modelling needs." ;
  skos:example "For examples, see the instances of [Aspect] defined in this ontology." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;
  .

imf:prefix a owl:AnnotationProperty ;
  skos:prefLabel "prefix" ;
  vs:term_status "testing" ;
  skos:definition "[prefix] is a relation from an [Aspect] *A* to a string *s* to specify that *s* is the prefix associated with *A*. Such prefix strings are typically used for identifying the aspect when constructing reference designation system (RDS) identifiers." ;
  skos:example "For examples, see the instances of [Aspect] defined in this ontology." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;
  rdfs:domain imf:Aspect ;
  rdfs:range xsd:string ;
  .

imf:color a owl:AnnotationProperty ;
  skos:prefLabel "color" ;
  vs:term_status "testing" ;
  skos:definition "[color] is a relation from a resource *X* to a string identifying a hexadecimal color *c* to specify that the *c* is a color that is associated with *A*.";
  skos:scopeNote "[Aspect]s are often associated with a distinct color, which is used in graphical presentations of IMF models." ;
  skos:example "For examples, see the instances of [Aspect] defined in this ontology." ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;
  rdfs:range xsd:string
  .


[] ottr:of o-imf:Aspect ;
   ottr:values( imf:functionAspect 'function' '=' '#FFFF00' '[function aspect] is an [Aspect] about the intended activity of [Element]s, i.e., the activity an [Element] perfoms or is designed to bring about. [function aspect] has /perspective/ \"Activity\", /interest/ \"System design\", and /modality/ \"Specification\".' ) . 
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:locationAspect 'location' '+' '#FF00FF' '[location aspect] is an [Aspect] about the spatial envelope (e.g., geometry, size and shape) of [Element]s. [location aspect] has /perspective/ \"Location\", /interest/ \"Geometry and Position\", and /modality/ \"Specification\".' ) . 
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:productAspect 'product' '-' '#00FFFF' '[product aspect] is an [Aspect] about the specification of a (physical) solution/implementation of [Element]s. [product aspect] has /perspective/ \"Artefact\", /interest/ \"Built\", and /modality/ \"Specification\".' ) . 
[] ottr:of o-imf:Aspect ;
   ottr:values( imf:installedAspect 'installed' '::' '#0000FF' '[installed aspect] is an [Aspect] about the information of [element] instances. [installed aspect] has /perspective/ \"Artefact\", /interest/ \"Built\", and /modality/ \"Description of individual\".' ) . 

[] ottr:of o-owl-ax:DifferentIndividuals ;
   ottr:values( ( imf:functionAspect imf:locationAspect imf:productAspect imf:installedAspect ) ) . 

[] ottr:of o-imf:AspectClass ;
   ottr:values( imf:FunctionElement imf:functionAspect ) . 
[] ottr:of o-imf:AspectClass ;
   ottr:values( imf:LocationElement imf:locationAspect ) . 
[] ottr:of o-imf:AspectClass ;
   ottr:values( imf:ProductElement imf:productAspect ) . 
[] ottr:of o-imf:AspectClass ;
   ottr:values( imf:InstalledElement imf:installedAspect ) . 

[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:FunctionBlock imf:FunctionElement imf:Block ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:FunctionTerminal imf:FunctionElement imf:Terminal ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:LocationBlock imf:LocationElement imf:Block ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:LocationTerminal imf:LocationElement imf:Terminal ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:ProductBlock imf:ProductElement imf:Block ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:ProductTerminal imf:ProductElement imf:Terminal ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:InstalledBlock imf:InstalledElement imf:Block ) . 
[] ottr:of o-imf:AspectElementClass ;
   ottr:values( imf:InstalledTerminal imf:InstalledElement imf:Terminal ) . 

[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:asFunction imf:FunctionElement ) . 
[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:asLocation imf:LocationElement ) . 
[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:asProduct imf:ProductElement ) . 
[] ottr:of o-imf:InterAspectRelation ;
   ottr:values( imf:asInstalled imf:InstalledElement ) . 



imf:intraAspectRelation a owl:ObjectProperty ;
  skos:prefLabel "intra-aspect relation" ;
  skos:definition "[intra-aspect relation] a generic relation between [Element]s *E1* and *E2* such that *E1* and *E2* share at least one [Aspect]." ;
  vs:term_status "testing" ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;
  rdfs:domain imf:Element ;
  rdfs:range imf:Element ;
  .

#[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
#   ottr:values ( imf:AspectElement imf:intraAspectRelation imf:AspectElement ) .

imf:interAspectRelation a owl:ObjectProperty ;
  skos:prefLabel "inter-aspect relation" ;
  skos:definition "[inter-aspect relation] a generic relation between [Element]s *E1* and *E2* such that *E1* and *E2* do not share any [Aspect]s." ;
  vs:term_status "testing" ;
  skos:changeNote 
    "0.1.0 :: Added" ;
  vann:termGroup "aspects" ;
  rdfs:domain imf:Element ;
  rdfs:range imf:Element ;
  owl:propertyDisjointWith imf:intraAspectRelation ;
  .

imf:Attribute a owl:Class ;
  skos:prefLabel "Attribute" ;
  vs:term_status "testing" ;
  skos:definition "An [Attribute] describes a quality or characteristic of a resource by setting a [property], a [value], and optionally a [unit of measure]." ;
  skos:example "Color: red" , "Weight: 1250 kg" , "Maximum ambient operating temperature: 120 K" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  .

imf:hasAttribute a owl:ObjectProperty ;
  skos:prefLabel "has attribute" ;
  vs:term_status "testing" ;
  skos:definition "[has attribute] is a relation between an [Element] *E* and an [Attribute] *A* that specifies that *E* has the attribute *A*." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  rdfs:domain imf:Element ;
  rdfs:range  imf:Attribute .

imf:property a owl:ObjectProperty ;
  skos:prefLabel "property" ;
  vs:term_status "testing" ;
  skos:definition "[property] is an [external reference] that relates an [Attribute] *A* to a resource *X* to specify that *A* has the property *X*." ;
  skos:example "The [property] of an [Attribute] \"Weight: 1250 kg\" could be specified as WEIGTH <http://data.posccaesar.org/rdl/RDS356894>." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  rdfs:subPropertyOf imf:externalReference ;
  rdfs:domain imf:Attribute .

imf:uom a owl:ObjectProperty ;
  skos:prefLabel "unit of measure" ;
  skos:altLabel "uom" ;
  vs:term_status "testing" ;
  skos:definition "[unit of measure] is an [external reference] that relates an [Attribute] *A* to a resource *X* to specify that *A* has the unit of measure *X*." ;
  skos:example "The [unit of measure] of an [Attribute] \"Weight: 1250 kg\" could be specified as KILOGRAM <http://data.posccaesar.org/rdl/RDS1328669>." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  rdfs:subPropertyOf imf:externalReference ;
  rdfs:domain imf:Attribute .

imf:value a owl:DatatypeProperty ;
  skos:prefLabel "value" ;
  vs:term_status "testing" ;
  skos:definition "[value] relates an [Attribute] *A* to literal value *v* to specify that *A* has the value *v*." ;
  skos:example "The [value] of an [Attribute] \"Weight: 1250 kg\" could be specified as the literal \"1250\"^^xsd:integer (or using a different appropriate literal datatype)." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  rdfs:domain imf:Attribute 
.

#imf:AttributeGroup a owl:Class ;
#  skos:prefLabel "Attribute Group" ;
#  vs:term_status "testing" ;
#  skos:definition "An [Attribute Group] is a collection of [Attribute]s which are typically grouped for convenience as they describe closely related features or characteristics of a resource." ;
#  skos:example "The physical dimensions of a product, e.g., its length, width and height, could be grouped by an [Attribute Group]." ;
#  skos:editorialNote "Does an [Attribute Group] add any semantics? -- what is the difference from an [Attribute Group] and an [Element] with [Attribute]s?" ;
#  skos:changeNote 
#    "0.2.0 :: Added" ;
#  .
#
#imf:hasAttributeGroup a owl:ObjectProperty ;
#  skos:prefLabel "has attribute group" ;
#  vs:term_status "testing" ;
#  skos:definition "[has attribute group] is a relation between a resource *X* and an [Attribute Group] *A* that specifies that *X* has the attribute group *A*." ;
#  skos:editorialNote "See comment on [Attribute Group], does [has attribute group] represent a \"long-hand property\" meaning that attaching the Attributes of the Attribute Group directly is equivalent? Perhaps the functionality of [Attribute Group]s is best realised as aspect-less-types?" ;
#  skos:changeNote 
#    "0.2.0 :: Added" ;
#  rdfs:range imf:AttributeGroup .

imf:AttributeQualifier a owl:Class ;
  skos:prefLabel "Attribute Qualifier" ;
  vs:term_status "testing" ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  .

imf:hasAttributeQualifier a owl:ObjectProperty ;
  skos:prefLabel "has attribute qualifier" ;
  vs:term_status "testing" ;
  skos:definition "[has attribute qualifier] is a relation between an [Attribute] *A* and an [Attribute Qualifier] *Q* to specify that *A* is qualified by *Q*." ;
  skos:changeNote 
    "0.2.0 :: Added" ;
  vann:termGroup "attributes" ;
  rdfs:domain imf:Attribute ;
  rdfs:range  imf:AttributeQualifier .

imf:ProvenanceQualifier a owl:Class ;
  skos:prefLabel "Provenance Qualifier" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:calculatedQualifier a owl:NamedIndividual ;
  skos:prefLabel "calculated" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:measuredQualifier a owl:NamedIndividual ;
  skos:prefLabel "measured" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:specifiedQualifier a owl:NamedIndividual ;
  skos:prefLabel "specified" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

[] ottr:of o-imf:AttributeQualifier ;
   ottr:values( imf:ProvenanceQualifier (imf:calculatedQualifier imf:measuredQualifier imf:specifiedQualifier) ) . 

imf:RangeQualifier a owl:Class ;
  skos:prefLabel "Range Qualifier" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:averageQualifier a owl:NamedIndividual ;
  skos:prefLabel "average" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:maximumQualifier a owl:NamedIndividual ;
  skos:prefLabel "maximum" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:minimumQualifier a owl:NamedIndividual ;
  skos:prefLabel "minimum" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:nominalQualifier a owl:NamedIndividual ;
  skos:prefLabel "nominal" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:normalQualifier a owl:NamedIndividual ;
  skos:prefLabel "normal" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

[] ottr:of o-imf:AttributeQualifier ;
   ottr:values( imf:RangeQualifier (imf:averageQualifier imf:maximumQualifier imf:minimumQualifier imf:nominalQualifier imf:normalQualifier) ) . 

imf:RegularityQualifier a owl:Class ;
  skos:prefLabel "Regularity Qualifier" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:absoluteQualifier a owl:NamedIndividual ;
  skos:prefLabel "absolute" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:continuousQualifier a owl:NamedIndividual ;
  skos:prefLabel "continuous" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

[] ottr:of o-imf:AttributeQualifier ;
   ottr:values( imf:RegularityQualifier (imf:absoluteQualifier imf:continuousQualifier) ) . 

imf:ScopeQualifier a owl:Class ;
  skos:prefLabel "Scope Qualifier" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:designQualifier a owl:NamedIndividual ;
  skos:prefLabel "design" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

imf:operatingQualifier a owl:NamedIndividual ;
  skos:prefLabel "operating" ;
  vs:term_status "testing" ;
  #skos:definition "";
  skos:changeNote
     "0.2.0 :: Added" ;
  vann:termGroup "attributes";
.

[] ottr:of o-imf:AttributeQualifier ;
   ottr:values( imf:ScopeQualifier (imf:designQualifier imf:operatingQualifier) ) . 


[] ottr:of o-owl-ax:DisjointClasses ;
   ottr:values( ( imf:ProvenanceQualifier imf:RangeQualifier imf:RegularityQualifier imf:ScopeQualifier ) ) . 

#+end_example

**** Processing                                                          :QA:

#+NAME: py_aspectelement_interaspect_rels
#+BEGIN_SRC python :var table=tbl-aspects :exports none
output = ""

for row in table:
  aspect = row[0].replace("imf:","").replace("Aspect", "").capitalize()
  color = row[2].replace("'","").replace("#","")

  ae = aspect + "Element"

  output += "class " + ae + " #back:" + color + "\n"
  output += "AspectElement --> " + ae + " : as" + aspect + "\n"
  output += "AspectElement <|-- " + ae + " \n"

return output
#+END_SRC

#+RESULTS: py_aspectelement_interaspect_rels
#+begin_example
class FunctionElement #back:FFFF00
AspectElement --> FunctionElement : asFunction
AspectElement <|-- FunctionElement 
class LocationElement #back:FF00FF
AspectElement --> LocationElement : asLocation
AspectElement <|-- LocationElement 
class ProductElement #back:00FFFF
AspectElement --> ProductElement : asProduct
AspectElement <|-- ProductElement 
class InstalledElement #back:0000FF
AspectElement --> InstalledElement : asInstalled
AspectElement <|-- InstalledElement
#+end_example


#+NAME: py_aspectelement_subs
#+BEGIN_SRC python :var table=tbl-aspects :exports none
output = ""

for row in table:
  aspect = row[0].replace("imf:","").replace("Aspect", "").capitalize()
  color = row[2].replace("'","").replace("#","")

  for element in ['Block', 'Terminal']:
    ae = aspect + element

    output += "class " + ae + " #back:" + color + "\n"
    output += element + " <|-- " + ae + "\n" 
    output += aspect + "Element <|-- " + ae + "\n" 

output += "\n"
return output
#+END_SRC

#+RESULTS: py_aspectelement_subs
#+begin_example
class FunctionBlock #back:FFFF00
Block <|-- FunctionBlock
FunctionElement <|-- FunctionBlock
class FunctionTerminal #back:FFFF00
Terminal <|-- FunctionTerminal
FunctionElement <|-- FunctionTerminal
class LocationBlock #back:FF00FF
Block <|-- LocationBlock
LocationElement <|-- LocationBlock
class LocationTerminal #back:FF00FF
Terminal <|-- LocationTerminal
LocationElement <|-- LocationTerminal
class ProductBlock #back:00FFFF
Block <|-- ProductBlock
ProductElement <|-- ProductBlock
class ProductTerminal #back:00FFFF
Terminal <|-- ProductTerminal
ProductElement <|-- ProductTerminal
class InstalledBlock #back:0000FF
Block <|-- InstalledBlock
InstalledElement <|-- InstalledBlock
class InstalledTerminal #back:0000FF
Terminal <|-- InstalledTerminal
InstalledElement <|-- InstalledTerminal
#+end_example

** OWL Ontology

#+NAME: owl-types-ontology
#+BEGIN_SRC ttl :noweb strip-export :tangle out/owl/imf-types.owl.wottr.ttl :mkdirp yes
<<prefixes>>

<http://ns.imfid.org/imf-types> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/20230331/imf-types> ;
    ## owl:imports <http://ns.imfid.org/20230331/imf-top> ;
    skos:prefLabel "Information Modelling Framework Ontology: Types " ;
    skos:altLabel "IMF types ontology" ;
    skos:scopeNote """

    """;
    .

<<owl-types-type>>
<<owl-types-instanceOf>>
<<owl-types-typeconstraint>>
<<owl-types-relationconstraints>>

#+END_SRC

#+RESULTS: owl-types-ontology
#+begin_example
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix pav:	<http://purl.org/pav/> .
@prefix sh: 	<http://www.w3.org/ns/shacl#> . 
@prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> .
@prefix ex:	<http://example.com#> .
@prefix imf:	<http://ns.imfid.org/imf#> .

@prefix p14:    <http://example.com/P14#> .
@prefix ottr:        <http://ns.ottr.xyz/0.4/> .
@prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> .
@prefix o-rdfs:       <http://tpl.ottr.xyz/rdfs/0.2/> .
@prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> .
@prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> .
@prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> .
@prefix o-imf:	     <http://ns.imfid.org/templates/> .

<http://ns.imfid.org/imf-types> a owl:Ontology ;
    owl:versionIRI <http://ns.imfid.org/20230331/imf-types> ;
    ## owl:imports <http://ns.imfid.org/20230331/imf-top> ;
    skos:prefLabel "Information Modelling Framework Ontology: Types " ;
    skos:altLabel "IMF types ontology" ;
    skos:scopeNote """

    """;
    .

imf:Type a owl:Class ;
  skos:prefLabel "Type";
  .

imf:ElementType a owl:Class ;
  rdfs:subClassOf imf:Type ;
  skos:prefLabel "Element Type";
  .

imf:BlockType a owl:Class ;
  rdfs:subClassOf imf:ElementType ;
  skos:prefLabel "Block Type";
  .

imf:TerminalType a owl:Class ;
  rdfs:subClassOf imf:ElementType ;
  skos:prefLabel "Terminal Type";
  .

imf:AttributeType a owl:Class ;
  rdfs:subClassOf imf:Type ;
  skos:prefLabel "Attribute Type";
  .

imf:AttributeGroupType a owl:Class ;
  rdfs:subClassOf imf:Type ;
  skos:prefLabel "Attribute Group Type";
  .

imf:hasTerminalType a owl:ObjectProperty ;
  rdfs:domain imf:BlockType ;
  rdfs:range imf:TerminalType ;
  .

imf:instanceOf a owl:ObjectProperty ;
  skos:prefLabel "instance of" ;
  rdfs:range imf:Type .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:Element imf:instanceOf imf:ElementType ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:Block imf:instanceOf imf:BlockType ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:Terminal imf:instanceOf imf:TerminalType ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:Attribute imf:instanceOf imf:AttributeType ) .

[] ottr:of o-owl-ax:SubObjectAllValuesFrom ;
   ottr:values ( imf:AttributeGroup imf:instanceOf imf:AttributeGroupType ) .
imf:TypeConstraint a owl:Class .

[] ottr:of o-owl-ax:SubDataMaxCardinality ;
   ottr:values ( imf:TypeConstraint "1"^^xsd:nonNegativeInteger imf:minCount xsd:integer ) .
[] ottr:of o-owl-ax:SubDataMaxCardinality ;
   ottr:values ( imf:TypeConstraint "1"^^xsd:nonNegativeInteger imf:maxCount xsd:integer ) .

[] ottr:of o-owl-ax:SubObjectMaxCardinality ;
   ottr:values ( imf:ElementType "1"^^xsd:nonNegativeInteger imf:hasAspect imf:Aspect ) .
[] ottr:of o-owl-ax:SubDataMaxCardinality ;
   ottr:values ( imf:ElementType "1"^^xsd:nonNegativeInteger skos:notation rdfs:Literal ) .
[] ottr:of o-owl-ax:SubDataMaxCardinality ;
   ottr:values ( imf:ElementType "1"^^xsd:nonNegativeInteger imf:symbol rdfs:Literal ) .

[] ottr:of o-owl-ax:SubObjectMaxCardinality ;
   ottr:values ( imf:TerminalType "1"^^xsd:nonNegativeInteger imf:hasDirection imf:Direction ) .
[] ottr:of o-owl-ax:SubObjectMaxCardinality ;
   ottr:values ( imf:TerminalType "1"^^xsd:nonNegativeInteger imf:hasMedium owl:Thing ) .
#+end_example

*** Type expansion: SHACL

#+BEGIN_SRC sh :exports none :results raw
java -jar bin/lutra.jar -f -L stottr -l out/ottr/shacl.stottr -I tabottr example/pumpingFunctionType.xlsx | rapper - -i turtle -o turtle -I 'http://example.com#' > example/pumpingFunctionType.xlsx.ttl
#+END_SRC

#+RESULTS:
rapper: Parsing file <stdin> with parser turtle and base URI http://example.com#
rapper: Serializing with serializer turtle and base URI http://example.com#
rapper: Parsing returned 167 triples

#+INCLUDE: "example/pumpingFunctionType.xlsx.ttl" src ttl

*** All prefixes combined                                          :noexport:

#+NAME: prefixes
#+BEGIN_SRC ttl :noweb yes
<<prefixes-std>>
<<prefixes-imf>>
<<prefixes-ottr>>
#+END_SRC

#+RESULTS: prefixes
#+begin_example
@prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
@prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
@prefix owl:    <http://www.w3.org/2002/07/owl#> .
@prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
@prefix pav:	<http://purl.org/pav/> .
@prefix sh: 	<http://www.w3.org/ns/shacl#> . 
@prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> .
@prefix ex:	<http://example.com#> .
@prefix imf:	<http://ns.imfid.org/imf#> .

@prefix p14:    <http://example.com/P14#> .
@prefix ottr:        <http://ns.ottr.xyz/0.4/> .
@prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> .
@prefix o-rdfs:       <http://tpl.ottr.xyz/rdfs/0.2/> .
@prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> .
@prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> .
@prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> .

@prefix o-imf:	     <http://ns.imfid.org/templates/> .
@prefix o-imf-t-s:   <http://ns.imfid.org/templates/type/shacl/> .
#+end_example

#+NAME: py_prefixes_sparql
#+BEGIN_SRC python :var prefixes=prefixes 
output = ""

for p in prefixes.split("\n"):
  output += p.replace("@","").strip().strip(".") + "\n"

return output
#+END_SRC

#+RESULTS: py_prefixes_sparql
#+begin_example
prefix xsd:	<http://www.w3.org/2001/XMLSchema#> 
prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> 
prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> 
prefix owl:    <http://www.w3.org/2002/07/owl#> 
prefix skos:	<http://www.w3.org/2004/02/skos/core#> 
prefix pav:	<http://purl.org/pav/> 
prefix sh: 	<http://www.w3.org/ns/shacl#> 
prefix shsh:   <http://www.w3.org/ns/shacl-shacl#> 
prefix ex:	<http://example.com#> 
prefix imf:	<http://ns.imfid.org/imf#> 

prefix p14:    <http://example.com/P14#> 
prefix ottr:        <http://ns.ottr.xyz/0.4/> 
prefix o-rdf:       <http://tpl.ottr.xyz/rdf/0.1/> 
prefix o-rdfs:       <http://tpl.ottr.xyz/rdfs/0.2/> 
prefix o-owl-ax:    <http://tpl.ottr.xyz/owl/axiom/0.1/> 
prefix o-owl-ma:    <http://tpl.ottr.xyz/owl/macro/0.1/> 
prefix o-owl-rstr:  <http://tpl.ottr.xyz/owl/restriction/0.1/> 

prefix o-imf:	     <http://ns.imfid.org/templates/> 
prefix o-imf-t-s:   <http://ns.imfid.org/templates/type/shacl/>
#+end_example




*** Download

#+BEGIN_SRC sh :results raw
cd bin
wget -O apache-jena.zip -nc -x https://dlcdn.apache.org/jena/binaries/apache-jena-4.4.0.zip
unzip apache-jena.zip
mv apache-jena-4.4.0 apache-jena
#+END_SRC

#+RESULTS:
File ‘apache-jena.zip’ already there; not retrieving.
Archive:  apache-jena.zip
   creating: apache-jena-4.4.0/
   creating: apache-jena-4.4.0/bin/
   creating: apache-jena-4.4.0/bat/
   creating: apache-jena-4.4.0/src-examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/bin/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/aggregates/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/algebra/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/auth/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/bgpmatching/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/constructquads/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/engine/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/filter/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/propertyfunction/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/update/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/helloworld/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/pizza/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/streaming/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shacl/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shacl/examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shex/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shex/examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/resources/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/resources/data/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/main/resources/ontologies/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/test/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/test/java/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/test/java/org/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/test/java/org/apache/
   creating: apache-jena-4.4.0/src-examples/jena-examples/src/test/java/org/apache/jena_examples/
   creating: apache-jena-4.4.0/src-examples/data/
   creating: apache-jena-4.4.0/src-examples/jena/
   creating: apache-jena-4.4.0/src-examples/jena/examples/
   creating: apache-jena-4.4.0/src-examples/jena/examples/ontology/
   creating: apache-jena-4.4.0/src-examples/jena/examples/ontology/classHierarchy/
   creating: apache-jena-4.4.0/src-examples/jena/examples/ontology/describeClass/
   creating: apache-jena-4.4.0/src-examples/jena/examples/rdf/
   creating: apache-jena-4.4.0/lib/
   creating: apache-jena-4.4.0/lib-src/
  inflating: apache-jena-4.4.0/README  
  inflating: apache-jena-4.4.0/LICENSE  
  inflating: apache-jena-4.4.0/NOTICE  
  inflating: apache-jena-4.4.0/bin/arq  
  inflating: apache-jena-4.4.0/bin/infer  
  inflating: apache-jena-4.4.0/bin/iri  
  inflating: apache-jena-4.4.0/bin/jena  
  inflating: apache-jena-4.4.0/bin/jena.version  
  inflating: apache-jena-4.4.0/bin/juuid  
  inflating: apache-jena-4.4.0/bin/nquads  
  inflating: apache-jena-4.4.0/bin/ntriples  
  inflating: apache-jena-4.4.0/bin/qparse  
  inflating: apache-jena-4.4.0/bin/rdfcat  
  inflating: apache-jena-4.4.0/bin/rdfcompare  
  inflating: apache-jena-4.4.0/bin/rdfcopy  
  inflating: apache-jena-4.4.0/bin/rdfdiff  
  inflating: apache-jena-4.4.0/bin/rdfparse  
  inflating: apache-jena-4.4.0/bin/rdfxml  
  inflating: apache-jena-4.4.0/bin/riot  
  inflating: apache-jena-4.4.0/bin/rset  
  inflating: apache-jena-4.4.0/bin/rsparql  
  inflating: apache-jena-4.4.0/bin/rupdate  
  inflating: apache-jena-4.4.0/bin/schemagen  
  inflating: apache-jena-4.4.0/bin/shacl  
  inflating: apache-jena-4.4.0/bin/shex  
  inflating: apache-jena-4.4.0/bin/sparql  
  inflating: apache-jena-4.4.0/bin/tdb1.xloader  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbbackup  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbcompact  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbdump  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbloader  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbquery  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbstats  
  inflating: apache-jena-4.4.0/bin/tdb2.tdbupdate  
  inflating: apache-jena-4.4.0/bin/tdb2.xloader  
  inflating: apache-jena-4.4.0/bin/tdbbackup  
  inflating: apache-jena-4.4.0/bin/tdbdump  
  inflating: apache-jena-4.4.0/bin/tdbloader  
  inflating: apache-jena-4.4.0/bin/tdbloader2  
  inflating: apache-jena-4.4.0/bin/tdbquery  
  inflating: apache-jena-4.4.0/bin/tdbstats  
  inflating: apache-jena-4.4.0/bin/tdbupdate  
  inflating: apache-jena-4.4.0/bin/trig  
  inflating: apache-jena-4.4.0/bin/turtle  
  inflating: apache-jena-4.4.0/bin/uparse  
  inflating: apache-jena-4.4.0/bin/update  
  inflating: apache-jena-4.4.0/bin/utf8  
  inflating: apache-jena-4.4.0/bin/wwwdec  
  inflating: apache-jena-4.4.0/bin/wwwenc  
  inflating: apache-jena-4.4.0/bin/xload-common  
  inflating: apache-jena-4.4.0/bin/xload-data  
  inflating: apache-jena-4.4.0/bin/xload-index  
  inflating: apache-jena-4.4.0/bin/xload-main  
  inflating: apache-jena-4.4.0/log4j2.properties  
  inflating: apache-jena-4.4.0/bat/arq.bat  
  inflating: apache-jena-4.4.0/bat/infer.bat  
  inflating: apache-jena-4.4.0/bat/iri.bat  
  inflating: apache-jena-4.4.0/bat/jena_version.bat  
  inflating: apache-jena-4.4.0/bat/juuid.bat  
  inflating: apache-jena-4.4.0/bat/nquads.bat  
  inflating: apache-jena-4.4.0/bat/ntriples.bat  
  inflating: apache-jena-4.4.0/bat/qparse.bat  
  inflating: apache-jena-4.4.0/bat/rdfcat.bat  
  inflating: apache-jena-4.4.0/bat/rdfcompare.bat  
  inflating: apache-jena-4.4.0/bat/rdfcopy.bat  
  inflating: apache-jena-4.4.0/bat/rdfdiff.bat  
  inflating: apache-jena-4.4.0/bat/rdfparse.bat  
  inflating: apache-jena-4.4.0/bat/rdfxml.bat  
  inflating: apache-jena-4.4.0/bat/riot.bat  
  inflating: apache-jena-4.4.0/bat/rset.bat  
  inflating: apache-jena-4.4.0/bat/rsparql.bat  
  inflating: apache-jena-4.4.0/bat/rupdate.bat  
  inflating: apache-jena-4.4.0/bat/schemagen.bat  
  inflating: apache-jena-4.4.0/bat/shacl.bat  
  inflating: apache-jena-4.4.0/bat/shex.bat  
  inflating: apache-jena-4.4.0/bat/sparql.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbbackup.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbcompact.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbdump.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbloader.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbquery.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbstats.bat  
  inflating: apache-jena-4.4.0/bat/tdb2_tdbupdate.bat  
  inflating: apache-jena-4.4.0/bat/tdbbackup.bat  
  inflating: apache-jena-4.4.0/bat/tdbdump.bat  
  inflating: apache-jena-4.4.0/bat/tdbloader.bat  
  inflating: apache-jena-4.4.0/bat/tdbquery.bat  
  inflating: apache-jena-4.4.0/bat/tdbstats.bat  
  inflating: apache-jena-4.4.0/bat/tdbupdate.bat  
  inflating: apache-jena-4.4.0/bat/trig.bat  
  inflating: apache-jena-4.4.0/bat/turtle.bat  
  inflating: apache-jena-4.4.0/bat/uparse.bat  
  inflating: apache-jena-4.4.0/bat/update.bat  
  inflating: apache-jena-4.4.0/bat/utf8.bat  
  inflating: apache-jena-4.4.0/bat/wwwdec.bat  
  inflating: apache-jena-4.4.0/bat/wwwenc.bat  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/README.md  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/bin/get-data  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/pom.xml  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExModelStore01.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExModification01.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExProg1.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExProg2.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExQuerySelect1.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExQuerySelect2.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExQuerySubstitute_01.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExampleDBpedia1.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExampleDBpedia2.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExampleDBpedia3.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/ExamplesServer.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/aggregates/CustomAggregate.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/algebra/AlgebraEx.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/algebra/AlgebraExec.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/auth/ExAuth00_Setup.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/auth/ExAuth01_RDFConnectionPW.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/auth/ExAuth02_QueryExecutionPW.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/auth/ExAuth03_UpdateExecutionPW.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/auth/ExAuth04_ServicePW.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/bgpmatching/OpExecutorAlt.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/bgpmatching/StageAltMain.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/bgpmatching/StageGeneratorAlt.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/constructquads/ExampleConstructQuads.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/engine/MyQueryEngine.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/filter/classify.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/propertyfunction/labelSearch.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/propertyfunction/localname.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/propertyfunction/uppercase.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT1_ReadModel.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT2_ReadDataset.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT3_RDFParser.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT4_StreamRDF_Filter.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT5_StreamRDFCollect.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT6_AddNewReader.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT7_AddNewWriter.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT8_RelativeURIs.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT9_AsyncParser.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT_RDFXML_ReaderProperties.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT_RDFXML_WriteProperties.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT_writeModel.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/ExRIOT_writeRDF.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/riot/Ex_WriteJsonLD.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/update/UpdateExecuteOperations.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/update/UpdateProgrammatic.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/arq/examples/update/UpdateReadFromFile.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/Base.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/CheeseBase.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/helloworld/HelloWorld.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/pizza/PizzaSparqlNoInf.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/org/apache/jena/example/streaming/StreamRDFToConnection.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/RDFConnectionExample1.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/RDFConnectionExample2.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/RDFConnectionExample3.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/RDFConnectionExample4.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/RDFConnectionExample5.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/rdfconnection/examples/RDFConnectionExample6.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shacl/examples/Shacl01_validateGraph.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shacl/examples/Shacl02_validateTransaction.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shex/examples/Shex01_validateGraph.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shex/examples/Shex02_validateNode.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/shex/examples/Shex03_validate.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExQuadFilter.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB1.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB2.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB3.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB4.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB5.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB6.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB_Txn1.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB_Txn2.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/java/tdb1/examples/ExTDB_Txn3.java  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/resources/data/cheeses-0.1.ttl  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/resources/data/pizza.owl.rdf  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/main/resources/ontologies/cheese.ttl  
  inflating: apache-jena-4.4.0/src-examples/jena-examples/src/test/java/org/apache/jena_examples/AppTest.java  
  inflating: apache-jena-4.4.0/src-examples/data/camera.owl  
  inflating: apache-jena-4.4.0/src-examples/data/eswc-2006-09-21.rdf  
  inflating: apache-jena-4.4.0/src-examples/data/test1.owl  
  inflating: apache-jena-4.4.0/src-examples/data/test2.owl  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/ontology/classHierarchy/ClassHierarchy.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/ontology/classHierarchy/Main.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/ontology/describeClass/DescribeClass.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/ontology/describeClass/Main.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial01.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial02.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial03.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial04.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial05.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial06.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial07.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial08.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial09.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial10.java  
  inflating: apache-jena-4.4.0/src-examples/jena/examples/rdf/Tutorial11.java  
  inflating: apache-jena-4.4.0/lib/jena-arq-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jsonld-java-0.13.4.jar  
  inflating: apache-jena-4.4.0/lib/commons-io-2.11.0.jar  
  inflating: apache-jena-4.4.0/lib/httpclient-cache-4.5.13.jar  
  inflating: apache-jena-4.4.0/lib/httpclient-4.5.13.jar  
  inflating: apache-jena-4.4.0/lib/httpcore-4.4.15.jar  
  inflating: apache-jena-4.4.0/lib/jcl-over-slf4j-1.7.35.jar  
  inflating: apache-jena-4.4.0/lib/jackson-core-2.13.1.jar  
  inflating: apache-jena-4.4.0/lib/jackson-databind-2.13.1.jar  
  inflating: apache-jena-4.4.0/lib/jackson-annotations-2.13.1.jar  
  inflating: apache-jena-4.4.0/lib/titanium-json-ld-1.2.0.jar  
  inflating: apache-jena-4.4.0/lib/jakarta.json-2.0.1.jar  
  inflating: apache-jena-4.4.0/lib/protobuf-java-3.19.3.jar  
  inflating: apache-jena-4.4.0/lib/libthrift-0.15.0.jar  
  inflating: apache-jena-4.4.0/lib/javax.annotation-api-1.3.2.jar  
  inflating: apache-jena-4.4.0/lib/commons-lang3-3.12.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-core-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-base-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-shaded-guava-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/commons-csv-1.9.0.jar  
  inflating: apache-jena-4.4.0/lib/commons-codec-1.15.jar  
  inflating: apache-jena-4.4.0/lib/commons-compress-1.21.jar  
  inflating: apache-jena-4.4.0/lib/collection-0.7.jar  
  inflating: apache-jena-4.4.0/lib/jena-iri-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/commons-cli-1.5.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-tdb-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-rdfconnection-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-shacl-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-shex-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-cmds-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-tdb2-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-dboe-storage-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-dboe-trans-data-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-dboe-transaction-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-dboe-base-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/jena-dboe-index-4.4.0.jar  
  inflating: apache-jena-4.4.0/lib/slf4j-api-1.7.35.jar  
  inflating: apache-jena-4.4.0/lib/log4j-slf4j-impl-2.17.1.jar  
  inflating: apache-jena-4.4.0/lib/log4j-api-2.17.1.jar  
  inflating: apache-jena-4.4.0/lib/log4j-core-2.17.1.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-arq-4.4.0-sources.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-core-4.4.0-sources.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-tdb-4.4.0-sources.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-rdfconnection-4.4.0-sources.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-shacl-4.4.0-sources.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-shex-4.4.0-sources.jar  
  inflating: apache-jena-4.4.0/lib-src/jena-cmds-4.4.0-sources.jar  

*** RIOT

Reading, writing and validating RDF.

#+BEGIN_SRC sh :results output verbatim
bin/apache-jena/bin/riot --help
#+END_SRC

#+RESULTS:
#+begin_example
riot [--help] [--time] [--base=IRI] [-syntax=FORMAT] [--out=FORMAT] [--count] file ...
  Parser control
      --sink                 Parse but throw away output
      --syntax=NAME          Set syntax (otherwise syntax guessed from file extension)
      --base=URI             Set the base URI (does not apply to N-triples and N-Quads)
      --check                Additional checking of RDF terms
      --strict               Run with in strict mode
      --validate             Same as --sink --check --strict
      --count                Count triples/quads parsed, not output them
      --rdfs=file            Apply some RDFS inference using the vocabulary in the file
      --nocheck              Turn off checking of RDF terms
  Output control
      --output=FMT           Output in the given format, streaming if possible.
      --formatted=FMT        Output, using pretty printing (consumes memory)
      --stream=FMT           Output, using a streaming format
      --compress             Compress the output with gzip
  Time
      --time                 Time the operation
  Symbol definition
      --set                  Set a configuration symbol to a value
  General
      -v   --verbose         Verbose
      -q   --quiet           Run with minimal output
      --debug                Output information for debugging
      --help
      --version              Version information
#+end_example

#+NAME: sh_jena_validate_rdf
#+BEGIN_SRC sh :results output verbatim :var syntax="TTL" :var files="out/owl/imf.owl.ttl"
bin/apache-jena/bin/riot --verbose --syntax=$syntax --validate --time $files 
#+END_SRC

#+RESULTS: sh_jena_validate_rdf
: file:///home/martige/repo/imf-lab/imf-ontology/out/owl/imf.owl.ttl : 0.22 sec : 494 Triples : 2,235.29 per second

#+NAME: sh_jena_merge
#+BEGIN_SRC sh :results output verbatim :var syntax="TTL" :var files="out/owl/imf-elements.owl.ttl out/owl/imf-attributes.owl.ttl" :var out="out/owl/imf.owl.ttl"
bin/apache-jena/bin/riot --verbose --syntax=$syntax --check --time $files > $out
#+END_SRC

#+RESULTS: sh_jena_merge
: 08:47:29 INFO  riot            :: File: out/owl/imf-elements.owl.ttl
: file:///home/martige/repo/imf-lab/imf-ontology/out/owl/imf-elements.owl.ttl : 0.19 sec : 146 Triples : 768.42 per second
: 08:47:29 INFO  riot            :: File: out/owl/imf-attributes.owl.ttl
: file:///home/martige/repo/imf-lab/imf-ontology/out/owl/imf-attributes.owl.ttl : 0.02 sec : 140 Triples : 7,000.00 per second
: Total           : 0.21 sec : 286 Triples : 1,361.90 per second

*** SHACL

Validate RDF wrt. SHACL shapes.

#+BEGIN_SRC sh :results output verbatim
bin/apache-jena/bin/shacl v --help
#+END_SRC

#+RESULTS:
#+begin_example
shacl_validate [--target URI] --shapes shapesFile --data dataFile
  General
      -v   --verbose         Verbose
      -q   --quiet           Run with minimal output
      --debug                Output information for debugging
      --help
      --version              Version information
      --shapes               Shapes file
      --data                 Data file
      --target               Validate specific node [may use prefixes from the data]
      --text                 Output in concise text format
#+end_example

#+NAME: sh_jena_shacl_validate
#+BEGIN_SRC sh :results output raw :var shapes="shapefile" :var data="rdf-examples/coffee-machine.ttl" :wrap src ttl
echo "Result of validating RDF data <$data> against SHACL shape <$shapes>:"
date +'%Y-%m-%d'
bin/apache-jena/bin/shacl v --text --shapes $shapes --data $data
#+END_SRC

#+RESULTS: sh_jena_shacl_validate
#+BEGIN_src ttl
Result of validating RDF data <rdf-examples/coffee-machine.ttl> against SHACL shape <shapefile>:
2023-06-15
Loading shapes file
org.apache.jena.riot.RiotNotFoundException: Not found: shapefile
	at org.apache.jena.riot.RDFParser.openTypedInputStream(RDFParser.java:409)
	at org.apache.jena.riot.RDFParser.parseURI(RDFParser.java:316)
	at org.apache.jena.riot.RDFParser.parse(RDFParser.java:310)
	at org.apache.jena.riot.RDFParserBuilder.parse(RDFParserBuilder.java:552)
	at org.apache.jena.riot.RDFDataMgr.parseFromURI(RDFDataMgr.java:737)
	at org.apache.jena.riot.RDFDataMgr.read(RDFDataMgr.java:193)
	at org.apache.jena.riot.RDFDataMgr.read(RDFDataMgr.java:135)
	at org.apache.jena.riot.RDFDataMgr.loadGraph(RDFDataMgr.java:352)
	at shacl.shacl_validate.load(shacl_validate.java:134)
	at shacl.shacl_validate.exec(shacl_validate.java:106)
	at org.apache.jena.cmd.CmdMain.mainMethod(CmdMain.java:92)
	at org.apache.jena.cmd.CmdMain.mainRun(CmdMain.java:58)
	at org.apache.jena.cmd.CmdMain.mainRun(CmdMain.java:45)
	at shacl.shacl_validate.main(shacl_validate.java:60)
	at shacl.shacl.main(shacl.java:81)
#+END_src


#+NAME: sh_jena_shacl_imf_validate
#+BEGIN_SRC sh :results output raw :var data="rdf-examples/coffee-machine.ttl" :wrap src ttl
bin/apache-jena/bin/shacl v --text --shapes shacl/imf-all.shacl.ttl --data $data
#+END_SRC

#+RESULTS: sh_jena_shacl_imf_validate
#+BEGIN_src ttl
Loading shapes file
org.apache.jena.riot.RiotNotFoundException: Not found: shacl/imf-all.shacl.ttl
	at org.apache.jena.riot.RDFParser.openTypedInputStream(RDFParser.java:409)
	at org.apache.jena.riot.RDFParser.parseURI(RDFParser.java:316)
	at org.apache.jena.riot.RDFParser.parse(RDFParser.java:310)
	at org.apache.jena.riot.RDFParserBuilder.parse(RDFParserBuilder.java:552)
	at org.apache.jena.riot.RDFDataMgr.parseFromURI(RDFDataMgr.java:737)
	at org.apache.jena.riot.RDFDataMgr.read(RDFDataMgr.java:193)
	at org.apache.jena.riot.RDFDataMgr.read(RDFDataMgr.java:135)
	at org.apache.jena.riot.RDFDataMgr.loadGraph(RDFDataMgr.java:352)
	at shacl.shacl_validate.load(shacl_validate.java:134)
	at shacl.shacl_validate.exec(shacl_validate.java:106)
	at org.apache.jena.cmd.CmdMain.mainMethod(CmdMain.java:92)
	at org.apache.jena.cmd.CmdMain.mainRun(CmdMain.java:58)
	at org.apache.jena.cmd.CmdMain.mainRun(CmdMain.java:45)
	at shacl.shacl_validate.main(shacl_validate.java:60)
	at shacl.shacl.main(shacl.java:81)
#+END_src


#+NAME: sh_jena_shacl_std_validate
#+BEGIN_SRC sh :results output raw :var data="out/owl/imf.owl.ttl" :wrap src ttl
echo "Result of validating RDF data <$data> against SHACL shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:\n"
bin/apache-jena/bin/shacl v --text --shapes http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl --data $data
#+END_SRC

#+RESULTS: sh_jena_shacl_std_validate
#+BEGIN_src ttl
Result of validating data <out/owl/imf.owl.ttl> against shape <http://shipshape.dyreriket.xyz/std-vocabulary-elements.ttl>:

Conforms
#+END_src

*** SPARQL

Query RDF.

#+BEGIN_SRC sh :results output verbatim
bin/apache-jena/bin/sparql --help
#+END_SRC

#+RESULTS:
#+begin_example
sparql --data=<file> --query=<query>
  Control
      --explain              Explain and log query execution
      --repeat=N or N,M      Do N times or N warmup and then M times (use for timing to overcome start up costs of Java)
      --optimize=            Turn the query optimizer on or off (default: on)
  Time
      --time                 Time the operation
  Query Engine
      --engine=EngineName    Register another engine factory[ref]
      --unengine=EngineName   Unregister an engine factory
  Dataset
      --data=FILE            Data for the dataset - triple or quad formats
      --graph=FILE           Graph for default graph of the datset
      --namedGraph=FILE      Add a graph into the dataset as a named graph
  Results
      --results=             Results format (Result set: text, XML, JSON, CSV, TSV; Graph: RDF serialization)
      --desc=                Assembler description file
  Query
      --query, --file        File containing a query
      --syntax, --in         Syntax of the query
      --base                 Base URI for the query
  Symbol definition
      --set                  Set a configuration symbol to a value
  General
      -v   --verbose         Verbose
      -q   --quiet           Run with minimal output
      --debug                Output information for debugging
      --help
      --version              Version information
      --strict               Operate in strict SPARQL mode (no extensions of any kind)
#+end_example


#+NAME: sh_jena_sparql
#+BEGIN_SRC sh :results output :var query="PREFIX imf: <http://ns.imfid.org/imf#> SELECT * {?s ?p ?o} LIMIT 1" :var files="out/owl/imf.owl.ttl" :hlines yes :exports both
echo "$query" > out/temp/.temp-sh_jena_sparql
bin/apache-jena/bin/sparql --results=text --data=$files --query out/temp/.temp-sh_jena_sparql
#+END_SRC

#+RESULTS: sh_jena_sparql
: ---------------------------------------------------------------------------------------------------------------
: | s    | p                                                 | o                                                |
: ===============================================================================================================
: | _:b0 | <http://www.w3.org/1999/02/22-rdf-syntax-ns#rest> | <http://www.w3.org/1999/02/22-rdf-syntax-ns#nil> |
: ---------------------------------------------------------------------------------------------------------------



** Lutra

Lutra is the reference implementation for working with OTTR templates
and instances.

This section contains the scripts that are used to expand the OTTR
instances found in this document.

#+BEGIN_SRC sh 
cd bin
wget -O lutra.jar -nc -x http://ottr.xyz/downloads/lutra/lutra-master.jar
#+END_SRC

#+RESULTS:

#+NAME: lutra-help
#+BEGIN_SRC sh :results output verbatim
java -jar bin/lutra.jar --help
#+END_SRC

#+RESULTS: lutra-help
#+begin_example
Usage: lutra [-fhV] [--debugFullTrace] [--debugStackTrace] [--quiet] [--stdout]
             [-F=<fetchFormat>] [--haltOn=<haltOn>] [-I=<inputFormat>]
             [-L=<libraryFormat>] [-m=<mode>] [-o=<out>] [-O=<outputFormat>]
             [-p=<prefixes>] [-e=<extensions>[,<extensions>...]]...
             [-E=<ignoreExtensions>[,<ignoreExtensions>...]]...
             [-l=<library>]... [<inputs>...]

DESCRIPTION:
Reference implementation for OTTR Templates. Use for expanding template
instances and template definitions, translating between different formats and
for checking the integrity of template libraries.

PARAMETERS:
      [<inputs>...]         Files of instances to which operations are to be
                              applied.

OPTIONS:
      --debugFullTrace      This enables tracing such that printed messages get
                              a stack trace giving more information on the
                              location of the concerned objects. NB! Enabling
                              this flag will deteriorate performance.
                            default: false)
      --debugStackTrace     This enables printing a regular java stack trace
                              for error messages.Enabling this flag will not
                              deteriorate performance.
                            default: false)
  -e, --extension=<extensions>[,<extensions>...]
                            File extension of files to use as input to template
                              library.
                            (default: [])
  -E, --ignoreExtension=<ignoreExtensions>[,<ignoreExtensions>...]
                            File extensions of files to ignore as input to
                              template library.
                            (default: [])
  -f, --fetchMissing        Fetch missing template dependencies. It is here
                              assumed that templates' definitions are
                              accessible via their IRI, that is, the IRI is
                              either a path to a file, a URL, or similar.
                            (default: false)
  -F, --fetchFormat=<fetchFormat>
                            The input format of the templates fetched via the
                              -f flag.
  -h, --help                Show this help message and exit.
      --haltOn=<haltOn>     Halt execution upon receiving messages with a
                              severity equal to or greater than this value.
                            (legal values: INFO, WARNING, ERROR, FATAL;
                              default: ERROR)
  -I, --inputFormat=<inputFormat>
                            Input format of instances.
                            (legal values: wottr, stottr, tabottr, bottr
                              default: wottr)
  -l, --library=<library>   Folder containing templates to use as library. Can
                              be used multiple times for multiple libraries.
  -L, --libraryFormat=<libraryFormat>
                            The input format of the libraries. If omitted, all
                              available formats are attempted.
                            (legal values: wottr, stottr)
  -m, --mode=<mode>         The mode of operation to be applied to input.
                            (legal values: expand, expandLibrary, format,
                              formatLibrary, lint, checkSyntax, docttrLibrary;
                              default: expand)
  -o, --output=<out>        Path for writing output.
  -O, --outputFormat=<outputFormat>
                            Output format of output of operation defined by the
                              mode.
                            (legal values: wottr, stottr; default: wottr)
  -p, --prefixes=<prefixes> Path to RDF file containing prefix declarations to
                              be used when rendering output.    Any other data
                              in the file is read, but ignored.
      --quiet               Suppress all messages, including errors and
                              warnings.
                            (default: false)
      --stdout              Print system of operations to standard out.
                            (default: false)
  -V, --version             Print version information and exit.

LINKS:
Website:  https://ottr.xyz
Primers:  https://primer.ottr.xyz
Git repo: https://gitlab.com/ottr/lutra/lutra
#+end_example

#+NAME: lutra-expand
#+BEGIN_SRC sh :results output verbatim :var in="out/owl/imf-aspects.owl.wottr.ttl" :var inFormat="wottr" :var out="out/owl/imf-aspects.owl.ttl"
java -jar bin/lutra.jar -l out/ottr -L stottr -f -p out/.std-prefixes.ttl -I $inFormat -o $in.temp $in 
rapper -i turtle -o turtle $in.temp > $out
cat $out
#+END_SRC

#+RESULTS: lutra-expand
*** TODO Script calls

TODO: setup download

#+BEGIN_SRC sh :results output verbatim
java -jar bin/rdfvizler.jar --help
#+END_SRC

#+RESULTS:
#+begin_example

RDFVizler: RDF visualisation

Usage:
java -jar rdfvizler-[version].jar [--help] [--mergeInput] [--skipRules]
                                  [--version]
                                  [--inputFormatRDF=<inputFormatRDF>]
                                  [--outputFormatRDF=<outputFormatRDF>]
                                  [-i=<outputFormatImage>] [-r=<rules>]
                                  [-x=<mode>] RDF_FILES...

Description:
RDFVizler visualises RDF by parsing a designated RDF RDFVizler vocabulary into
Graphviz syntax and processing this to a graph using Graphviz' dot software.
For more details, see http://rdfvizler.dyreriket.xyz.

Parameters:
      RDF_FILES...      Input RDF: URIs or file paths

Options:
  -x, --executionMode=<mode>
                        What output to produce. (legal values: rdf, dot, image;
                          default: image)
  -r, --rules=<rules>   Input rules: URI or file path (default: http://rdfvizler.
                          dyreriket.xyz/rules/rdf.jrule)
      --skipRules       Skip rule application to input? (default: false)
      --inputFormatRDF=<inputFormatRDF>
                        Format of RDF input (legal values: rdf, ttl, nt, guess;
                          default: guess -- by file extension as per jena.util.
                          FileUtils, then Turtle)
      --mergeInput      Merge input files to a single model to visualise?
      --outputFormatRDF=<outputFormatRDF>
                        Format of RDF output (legal values: rdf, ttl, nt, guess;
                          default: rdf)
  -i, --outputFormatImage=<outputFormatImage>
                        Format of image output (legal values: PNG, SVG,
                          SVG_STANDALONE, DOT, XDOT, PLAIN, PLAIN_EXT, PS, PS2,
                          JSON, JSON0, IMAP, CMAPX; default: SVG_STANDALONE)
      --version         Display version info
      --help            Display this help message
#+end_example


#+NAME: rdfvizler
#+BEGIN_SRC sh :results output verbatim :var rules="out/rdfvizler/import-hierarchy.rule" :var data="out/owl/imf.owl.ttl" :var output="out/.output-rdfvizler.svg"
java -jar bin/rdfvizler.jar --rules=$rules $data > $output
#+END_SRC

#+RESULTS: rdfvizler
#+begin_example
Exception in thread "main" picocli.CommandLine$ExecutionException: Error while running command (xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI@66498326): org.apache.jena.shared.RulesetNotFoundException: out/rdfvizler/import-hierarchy.rule
	at picocli.CommandLine.execute(CommandLine.java:1056)
	at picocli.CommandLine.access$900(CommandLine.java:142)
	at picocli.CommandLine$RunLast.handle(CommandLine.java:1255)
	at picocli.CommandLine$RunLast.handle(CommandLine.java:1223)
	at picocli.CommandLine$AbstractParseResultHandler.handleParseResult(CommandLine.java:1131)
	at picocli.CommandLine.parseWithHandlers(CommandLine.java:1414)
	at picocli.CommandLine.run(CommandLine.java:1878)
	at picocli.CommandLine.run(CommandLine.java:1808)
	at xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI.main(RDFVizlerCLI.java:133)
Caused by: org.apache.jena.shared.RulesetNotFoundException: out/rdfvizler/import-hierarchy.rule
	at org.apache.jena.reasoner.rulesys.Rule.rulesFromURL(Rule.java:511)
	at org.apache.jena.reasoner.rulesys.Rule.rulesFromURL(Rule.java:524)
	at xyz.dyreriket.rdfvizler.RDFVizler.getRules(RDFVizler.java:39)
	at xyz.dyreriket.rdfvizler.RDFVizler.getRDFDotModel(RDFVizler.java:72)
	at xyz.dyreriket.rdfvizler.RDFVizler.writeDotGraph(RDFVizler.java:105)
	at xyz.dyreriket.rdfvizler.RDFVizler.writeDotGraph(RDFVizler.java:111)
	at xyz.dyreriket.rdfvizler.RDFVizler.write(RDFVizler.java:99)
	at xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI.processFile(RDFVizlerCLI.java:156)
	at xyz.dyreriket.rdfvizler.cli.RDFVizlerCLI.run(RDFVizlerCLI.java:166)
	at picocli.CommandLine.execute(CommandLine.java:1048)
	... 8 more
#+end_example

*** Lists                                                          :noexport:

#+NAME: prefixlist
 - xsd :: http://www.w3.org/2001/XMLSchema#
 - rdf :: http://www.w3.org/1999/02/22-rdf-syntax-ns#
 - rdfs :: http://www.w3.org/2000/01/rdf-schema#
 - owl :: http://www.w3.org/2002/07/owl#
 - skos :: http://www.w3.org/2004/02/skos/core#
 - imf :: http://ns.imfid.org/imf#

#+NAME: py_functions
#+BEGIN_SRC python

## converts a org-mode definition list into a python dict
def deflist2dict(list):
  newlist={}
  for row in list:
    newrow = row[0].split(' :: ')
    newlist[newrow[0]] = newrow[1]

  return newlist

from rdflib import Graph, Namespace, URIRef

def getURIRef(prefixdict, qname):
  prefix, localname = qname.split(':')
  return URIRef(prefixdict[prefix] + localname)

def getGraph(prefixdict):
  graph = Graph()
  for key, value in prefixdict.items():
    ns = Namespace(value)
    graph.bind(key, ns)
  return graph
#+END_SRC

#+RESULTS: py_functions
: None

#+NAME: py_prefixlist2ttl
#+BEGIN_SRC python :noweb yes :var list=prefixlist 
<<py_functions>>

output = ""
for key, value in deflist2dict(list).items():
  output += '@prefix ' + key + ':\t<' + value + '> .\n'
return output
#+END_SRC

#+RESULTS: py_prefixlist2ttl
: @prefix xsd:	<http://www.w3.org/2001/XMLSchema#> .
: @prefix rdf:	<http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
: @prefix rdfs:	<http://www.w3.org/2000/01/rdf-schema#> .
: @prefix skos:	<http://www.w3.org/2004/02/skos/core#> .
: @prefix imf:	<http://ns.imfid.org/imf#> .

#+CALL: py_prefixlist2ttl[:wrap src ttl](list=prefixlist)
